<div id="quick-support-marketorders" uk-modal>
	<div class="uk-modal-dialog uk-card uk-padding-small uk-background-primary uk-border-rounded-mdm uk-margin-auto-vertical uk-width-2-3@m uk-width-1-2@xl">
		<button class="uk-modal-close-default uk-button-secondary uk-border-rounded-mdm" type="button" uk-close></button>
		<div class="uk-modal-header">
			<h3 class="uk-heading-bullet uk-margin-remove"><span class="uk-text-danger">Market Orderts </span><span>продажи и покупки с оплатой через сайт</span></h3>
		</div>
		<div class="uk-modal-body uk-background-default uk-text-light uk-font-face uk-text-justify" uk-overflow-auto>
			<p class="uk-margin">
			Расширение, <code>MarketOrderts</code> реализует функционал покупок и продаж, с оплатой через сайт, за товары и услуги, опубликованные в магазине, в маркетплейсе или в торговой витрине фриланс-биржи на Cotonti Siena, что доступно, если используется модуль <code>Market</code></p>
			<p class="uk-margin">Позволяет оплачивать товары/услуги с указанной ценой. 
			После оплаты Продавец уведомляется по email. При этом сумма за покупку резервируется на счету сайта на гарантийный срок (например 14 дней, устанавливается админом для всех), чтобы обеспечить безопасность проведения подобного рода продаж через сайт.</p>
			<p class="uk-margin">
			После покупки Продавец должен связаться с Покупателем и передать ему товар или оказать оплаченную услугу. Если до завершения гарантийного срока Покупатель обнаружил несоответствия товара/услуги заявленным в описании качествам, он в праве отправить жалобу по своему заказу в адрес Администрации сайта. После этого Администрация сайта будет принимать решение о полном возврате суммы заказа Покупателю или об отмене претензии в зависимости от ситуации.</p>
			<p class="uk-margin">
			Если претензий по заказу не было, то по истечению гарантийного срока оплата поступает на счет Продавца с вычетом комиссии сайта, которая заранее устанавливается в настройках плагина.</p>
			<h3 class="uk-margin-remove-bottom">Настройки для продажи файлов:</h3>
			<p class="uk-margin-bottom">
			Загружать можно только один файл. Если нужно продавать несколько файлов, то очевидно их необходимо запаковать в один архив <code>.ZIP</code> и загрузить на странице товара. Ссылка на скачивание товара будет доступна покупателю на странице оплаченного ЗАКАЗА в виде ссылки.</p>
		</div>
	</div>
</div>